<html>
<head>
	
	<title>Sistema Linux</title>
</head>

<body text="000000" bgcolor="00ffe0">

	<img src="img5.JPG" height="150" width="1340">

	<h1><center>¿Que es linux?</center></h1>
	<p>
Linux es el nombre que reciben una serie de sistemas operativos de tipo Unix bajo la licencia GNU GPL (General Public License o Licencia P&uacute;blica General de GNU). Estos sistemas operativos son en su mayor&iacute;a gratuitos y contienen todo lo necesario para hacer funcionar una computadora. La peculiaridad de Linux radica en que podemos instalar un sistema muy ligero y luego añadir todo lo necesario seg&uacute;n nuestras necesidades.
</p>

<h2>Puntos claves de Linux</h2>

<li>N&uacute;cleo o Kernel:<br> Linux es el nombre que recibe el núcleo o kernel de este sistema operativo. Las diferentes versiones de Linux se denominan distros (abreviatura de distribuciones). B&aacute;sicamente, una distro es este n&uacute;cleo del sistema al que se le han añadido aplicaciones y programas para construir un sistema operativo completo con muchas funciones.</li><br>

<li>Código Libre:<br> Al ser código libre, podemos utilizarlo, copiarlo, modificarlo y redistribuirlo libremente para cualquier uso que queramos darle, siempre bajo los términos de la licencia GPL de GNU.</li><br>

<li>Multiplataforma:<br> Linux es multiusuario, multitarea y multiplataforma. Puede funcionar en modo consola para un consumo m&iacute;nimo de recursos o con entorno gr&aacute;fico.</li><br>


<li>Historia:<br> Linux comenz&oacute; su andadura en el mundo del software libre alrededor del año 1980. La idea era crear un sistema operativo libre basado en Unix. Inicialmente, se llam&oacute; Minix, pero su creador, Linus Torvalds, no qued&oacute; satisfecho y acab&oacute; creando su propio sistema en 1991.</li><br>

<li>S%iacute;mbolos Representativos:<br>
El s&iacute;mbolo que representa a GNU es un Ñu.
Para Linux, tenemos al simpático pingüino llamado Tux.</li>

<h2>Beneficios</h2>

<ol>Linux ofrece numerosos beneficios a sus usuarios. A continuación, mencionar&eacute; algunas de las ventajas clave de este sistema operativo:</ol>

<ul>Gratuito:<br> Linux es un software libre y gratuito. Puedes adquirirlo sin costo alguno, y si lo deseas, tambi&eacute;n puedes obtenerlo pagando solo un precio simb&oacute;lico por el CD o el dispositivo de instalación. En comparaci&oacute;n con Windows o Mac, siempre resultar&aacute; más econ&oacute;mico</ul>

<ul>Personalizaci&oacute;n:<br> Linux es altamente personalizable. Puedes modificarlo para satisfacer tus necesidades espec&iacute;ficas o las de tu organizaci&oacute;n. Existen muchas distribuciones diferentes de Linux, cada una con caracter&iacute;sticas y configuraciones distintas.</ul>

<ul>Software Libre:<br> Linux ofrece una gran cantidad de software libre. A menudo, se cree err&oacute;neamente que Linux carece de suficientes aplicaciones y programas, pero esto es falso. Adem&aacute;s, al ser de c&oacute;digo abierto, puedes personalizar aún más estas aplicaciones seg&uacute;n tus preferencias.</ul>

<ul>Estabilidad:<br> Linux es conocido por su mayor estabilidad en comparaci&oacute;n con Windows. Empresas importantes y entidades gubernamentales confían en Linux debido a su rendimiento estable. Esto lo hace ideal para servidores en Internet, ya que es altamente confiable.</ul>

<ul>Requisitos de Recursos Bajos:<br> La mayor&iacute;a de las distribuciones de Linux pueden instalarse en PCs con recursos limitados. Puede funcionar sin problemas incluso con un procesador de 200 MHz y gestiona eficientemente la memoria RAM</ul>


<tt>En resumen, Linux es una excelente opci&oacute;n para aquellos que buscan un sistema operativo gratuito, personalizable y estable. Adem&aacute;s, su activa comunidad de usuarios y desarrolladores ofrece amplio soporte y recursos para cualquier problema o necesidad que pueda surgir.</tt>

<center><video src="Video4.mp4" controls height="500" width="500"></video></center>
<center><audio src="Audio4.mp3" controls>
            Tu navegador no soporta la etiqueta de audio.
          </audio></center>


<a href="Trabajo Practico.html">P&aacute;gina Prinsipal</a><br>
<a href="Linux.html">Volver arriba</a>

<img src="img5.JPG" height="150" width="1340">
</body>
</html>